# Аритметички изрази +, -, *, ** : во Python :
# 1. Собирање (+) --> оператор + (addition)
# 2. Одземање (-) --> оператор - (subtract)
# 3. Множење  (*) --> оператор * (multiply)
# 4. Делење   (:) --> оператор / (division)
# 5. Степенисување (^) --> оператор ** (exponent)

if __name__ == "__main__":
    # Иницијализација на променливи, дополнително објаснување на термини за податочни типови
    # на променливи и начин на доделување вредност и споредба на вредности на променливи
    a = 5
    b = 10
    c = 6
    d = 3

    # Собирање и за што служи функцијата print и што се овозможува
    print(f'Оператор за собирање (+)')
    sobiranje = a + b
    # Основна команда за печатење
    print(f'\t Збирот на броевите {a} и {b} e', sobiranje)
    print(f'')

    # Одземање
    print(f'Оператор за одземање (-)')
    odzemanje = b - a
    print(f'\t Разликата на броевите {b} и {a} e', odzemanje)
    print(f'')

    # Делење
    # Целобројно делење
    print(f'Оператори за делење (//), (/), (%)')
    cel_delenje = b // c
    print(f'\t Целобројно делење на броевите {b} и {c} e', cel_delenje)

    # Децимално делење
    dec_delenje = b / c
    print(f'\t Децимално делење на броевите {b} и {c} е', dec_delenje)

    # Остаток од делењето
    ostatok = b % c
    print(f'\t Остатокот при делењето на броевите {b} и {c} e', ostatok)
    print(f'')

    # Множење
    print(f'Оператор за множење (*)')
    mnozenje = a * b
    print(f'\t Множење на броевите {a} и {b} e', mnozenje)
    dec_mnozenje = a * 1.5
    print(f'\t Множење на бројот {a} со децимала 1.5 е', dec_mnozenje)

    # Степенување - експонент
    print(f'Оператор за степенување (**)')
    stepenuvanje = d ** a
    print(f'\t Степенување на бројот {d} со основа {a} e', mnozenje)