if __name__ == "__main__":
    # Повеќе кратно иницијализирање на променливи во една линија
    x, y, z, l, m, n = 1, 4, 3, 2, 5, 6
    # Сктура на избор и функции накратко
    # if - клучниот збор ни овозможува да извршиме нешто доколку ни исполнува одреден услов
    # def - клучниот збор за дефинирање на функција

    def paren(i):
        if i % 2 == 0:
            print(f'Бројот {i} е парен')
        else:
            print(f'Дадениот број не е парен')

    def neparen(i):
        if i % 2 != 0:
            print(f'Бројот {i} е непарен')
        else:
            print(f'Дадениот број не е непарен')
    paren(x)
    paren(y)
    neparen(y)
    neparen(z)